app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    # Orders than based on the "created_at" variable in a descending order
    @posts = Post.all.order ("created_at DESC")

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "test"], ["created_at", "2021-10-28 11:58:49.466818"], ["updated_at", "2021-10-28 11:58:49.466818"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save